In [1]:
import pandas as pd

In [2]:
data=pd.read_csv(r"C:\Users\zaina\OneDrive\Desktop\class 10 A.I\Pandas\data.csv")

In [3]:
data

                    books         authors  written in
0  The Pilgrim’s Progress     John Bunyan        1678
1         Robinson Crusoe    Daniel Defoe        1719
2      Gulliver’s Travels  Jonathan Swift        1726
3      Gulliver’s Travels  Jonathan Swift        1726

In [4]:
data.shape

(4, 3)

In [5]:
data.head(2)

                    books       authors  written in
0  The Pilgrim’s Progress   John Bunyan        1678
1         Robinson Crusoe  Daniel Defoe        1719

In [42]:
data.tail(2)

                books         authors  written in
2  Gulliver’s Travels  Jonathan Swift        1726
3  Gulliver’s Travels  Jonathan Swift        1726